{
  
  "nodes": [
  {
  "name": "data_1",
  "end": false,
  "default": true,
  "sender": "Leah Park, Marketing Manager",
  "title": "Pre-Campaign Check – Possible Duplicate Customer Records",
  "content": "Hi {first_name},<br/><br/>Before we launch our new 'Winter Protection' campaign, the Marketing team ran a quick data validation and noticed several customers appear more than once in the mailing list.<br/><br/>For example, we have both 'Daniel Smith' and 'Danielle Smyth' with the same email address but different customer IDs.<br/><br/>Could you please take a look before we send out the campaign? We want to avoid confusing customers or damaging the brand's credibility.<br/><br/>Thanks,\nLeah",
  "category": "scenario",
  "isUrgent": true,
  "choices": {
    "1": {
      "name": "1",
      "text": "Run a quick duplicate search in Salesforce to see if customer records are duplicated under different IDs.",
      "outcome": {
        "description": "You confirm that several customer profiles exist with nearly identical details. The issue looks system-driven, but the root cause is still unclear.",
        "impact": {
          "dataQuality": 0,
          "stakeholderTrust": 1,
          "profit": -2000
        },
        "next": ["data_2A", "data_extra_1"]
      }
    },
    "2": {
      "name": "2",
      "text": "Reach out to the ${MDM} team to verify if recent configuration or matching rules could have created duplicate customer records.",
      "outcome": {
        "description": "The MDM team checks their latest updates and confirms that a recent configuration change lowered the match threshold to 90%. This may have allowed duplicate customer profiles to be created. Collaboration begins smoothly and you gain early insight into the root cause.",
        "impact": {
          "dataQuality": 2,
          "stakeholderTrust": 2,
          "profit": 0
        },
        "next": ["data_2B", "data_extra_1"]
      }
    },
    "3": {
      "name": "3",
      "text": "Tell Marketing it's probably a contact list issue on their end and suggest they clean their file before sending.",
      "outcome": {
        "description": "Marketing pushes back, explaining the list was extracted directly from MDM. They expect technical validation, not assumptions. Collaboration suffers.",
        "impact": {
          "dataQuality": -2,
          "stakeholderTrust": -3,
          "profit": -3000
        },
        "next": ["data_2C", "data_extra_1"]
      }
    }
  }
  },
  {
  "name": "data_2A",
  "end": false,
  "sender": "Leah Park, Marketing Manager",
  "title": "Follow-Up – Any Findings on the Duplicate Records?",
  "content": "Hi {first_name},<br/><br/>Thanks for checking Salesforce earlier. Have you had a chance to identify why these duplicate customer profiles exist? The campaign is on hold until we're confident the list is clean.<br/><br/>Let me know if you've found any pattern or system issue we should address before launch.<br/><br/>Thanks,\nLeah",
  "category": "scenario",
  "isUrgent": true,
  "choices": {
    "1": {
      "name": "1",
      "text": "Pull a sample of 100 customer records and run a data profiling check on IDs, emails, and matching results between Salesforce and MDM.",
      "outcome": {
        "description": "Your profiling confirms mismatched customer IDs between Salesforce and MDM. The duplicates appear to be system-generated, narrowing down the likely cause.",
        "impact": {
          "dataQuality": 2,
          "stakeholderTrust": 3,
          "profit": 1000
        },
        "next": ["data_3A"]
      }
    },
    "2": {
      "name": "2",
      "text": "Ask IT when the last synchronization with MDM ran and whether any records were skipped.",
      "outcome": {
        "description": "IT confirms the sync ran successfully but can't see details for inactive or filtered records. The investigation slows slightly while you wait for more data.",
        "impact": {
          "dataQuality": 0,
          "stakeholderTrust": 0,
          "profit": -2000
        },
        "next": ["data_3B"]
      }
    },
    "3": {
      "name": "3",
      "text": "Escalate the issue immediately to the Data Governance Council without concrete evidence.",
      "outcome": {
        "description": "The Council requests documentation and proof before acting. Your premature escalation causes some frustration among peers.",
        "impact": {
          "dataQuality": -2,
          "stakeholderTrust": -4,
          "profit": -4000
        },
        "next": ["data_3C"]
      }
    }
  }
},

 {
  "name": "data_2B",
  "end": false,
  "sender": "Raj Mehta, MDM Specialist",
  "title": "Re: Duplicate Customer Records – MDM Configuration Review",
  "content": "Hi {first_name},<br/><br/>We reviewed the latest MDM configuration and found something that could explain the duplicate customer records.<br/><br/>Last week, we adjusted the ${matching logic} to be more flexible — for example, allowing similar names like 'Daniel Smith' and 'Dan Smyth' to be considered the same person if they share an email address or phone number. The intent was to catch more potential duplicates that strict rules might miss. However, this change may have caused MDM to treat some different records as the same person, and when those updates were pushed to Salesforce, it created new duplicate profiles instead of merging with existing ones.<br/><br/>If you can share a few of the duplicate examples from the Marketing list, we can test them against the new logic to confirm whether that's what caused the issue.<br/><br/>Thanks,\nRaj",
  "category": "scenario",
  "isUrgent": false,
  "choices": {
    "1": {
      "name": "1",
      "text": "Extract several of the duplicate examples from the Marketing list and share them with MDM for analysis.",
      "outcome": {
        "description": "You provide clear examples that help the MDM team reproduce the behavior. The duplicates are confirmed to be caused by the relaxed matching rules. Collaboration strengthens as both teams align on next steps.",
        "impact": {
          "dataQuality": 4,
          "stakeholderTrust": 5,
          "profit": 1500
        },
        "next": ["data_3A"]
      }
    },
    "2": {
      "name": "2",
      "text": "Ask IT to verify if the nightly MDM-to-Salesforce integration applied the new matching logic correctly.",
      "outcome": {
        "description": "IT confirms the integration ran successfully but can't assess the effect of the new logic. The investigation slows while teams wait for sample data.",
        "impact": {
          "dataQuality": 0,
          "stakeholderTrust": -1,
          "profit": -1500
        },
        "next": ["data_3B"]
      }
    },
    "3": {
      "name": "3",
      "text": "Escalate the configuration issue to the Data Governance Council immediately.",
      "outcome": {
        "description": "The Council acknowledges your message but asks for concrete evidence first. The escalation pauses technical investigation until more information is provided.",
        "impact": {
          "dataQuality": 0,
          "stakeholderTrust": -2,
          "profit": -2000
        },
        "next": ["data_3C"]
      }
    }
  }
},

  {
  "name": "data_2C",
  "end": false,
  "sender": "Leah Park, Marketing Manager",
  "title": "Re: Duplicate Customer Records – Clarification",
  "content": "Hi {first_name},<br/><br/>Just to clarify — our campaign list came directly from MDM without any manual edits. If duplicates are showing, something might be off in the integration or ${matching rules}.<br/><br/>Could you double-check with the data teams before we decide how to proceed?<br/><br/>Thanks,\nLeah",
  "category": "scenario",
  "isUrgent": true,
  "choices": {
    "1": {
      "name": "1",
      "text": "Acknowledge the misunderstanding and commit to investigating the MDM data source for duplicate logic issues.",
      "outcome": {
        "description": "You take ownership and reassure Marketing that you'll coordinate with MDM. Trust begins to recover, and the investigation refocuses on root cause analysis.",
        "impact": {
          "dataQuality": 1,
          "stakeholderTrust": 1,
          "profit": 0
        },
        "next": ["data_3A"]
      }
    },
    "2": {
      "name": "2",
      "text": "Forward the message to MDM asking whether they've changed ${matching logic} recently.",
      "outcome": {
        "description": "The MDM team confirms a configuration change but requests examples. You lose time relaying messages instead of coordinating directly.",
        "impact": {
          "dataQuality": 0,
          "stakeholderTrust": -1,
          "profit": -1500
        },
        "next": ["data_3B"]
      }
    },
    "3": {
      "name": "3",
      "text": "Insist again that the duplicates probably come from Marketing's contact file.",
      "outcome": {
        "description": "Marketing grows frustrated with your lack of collaboration and escalates concerns to leadership. Trust declines sharply.",
        "impact": {
          "dataQuality": -5,
          "stakeholderTrust": -5,
          "profit": -3000
        },
        "next": ["data_3C"]
      }
    }
  }
},

  {
  "name": "data_3A",
  "end": false,
  "sender": "Raj Mehta, MDM Specialist",
  "title": "Update – Duplicate Root Cause Confirmed",
  "content": "Hi {first_name},<br/><br/>Thanks for sending the sample records. We've confirmed that the duplicates are indeed caused by the recent change in MDM's matching logic.<br/><br/>The system treated records with the same contact details but slightly different spellings as one person. When these merged records were pushed to Salesforce, they didn't link properly to the existing profiles, creating new IDs instead of updating the old ones.<br/><br/>We can temporarily revert the ${matching rule} to the previous setting while we design a more precise logic. Would you like us to roll that back, or would you prefer we test a targeted fix first?<br/><br/>Thanks,\nRaj",
  "category": "scenario",
  "isUrgent": false,
  "choices": {
    "1": {
      "name": "1",
      "text": "Ask Raj to roll back the previous matching logic immediately to stop the duplicates.",
      "outcome": {
        "description": "The rollback stops new duplicates from being created, but a few valid merges are lost in the process. The issue is contained quickly, though it requires cleanup later.",
        "impact": {
          "dataQuality": 2,
          "stakeholderTrust": 2,
          "profit": -1000
        },
        "next": ["data_4A"]
      }
    },
    "2": {
      "name": "2",
      "text": "Request a temporary patch that allows MDM to match only on exact emails while the investigation continues.",
      "outcome": {
        "description": "The MDM team deploys a controlled fix that stabilizes data without losing valid matches. You keep the system running smoothly while analyzing long-term solutions.",
        "impact": {
          "dataQuality": 5,
          "stakeholderTrust": 4,
          "profit": 2000
        },
        "next": ["data_4B"]
      }
    },
    "3": {
      "name": "3",
      "text": "Hold off on any system change until you get formal approval from the Governance Council.",
      "outcome": {
        "description": "The delay allows more duplicates to appear while waiting for sign-off. Marketing expresses concern about the slowdown.",
        "impact": {
          "dataQuality": -3,
          "stakeholderTrust": -2,
          "profit": -3500
        },
        "next": ["data_4C"]
      }
    }
  }
},

  {
  "name": "data_3B",
  "end": false,
  "sender": "Dev Patel, Data Engineer",
  "title": "MDM Integration Logs Reviewed – Partial Findings",
  "content": "Hi {first_name},<br/><br/>I reviewed the integration logs between MDM and Salesforce. The jobs completed successfully with no technical errors. However, I noticed that some records were skipped from matching because their name fields didn't align perfectly, even though their emails were the same.<br/><br/>That might explain why Salesforce created new IDs instead of updating existing records. Would you like me to apply a patch to reprocess those records, or should we coordinate with Raj to refine the matching rules first?<br/><br/>Best,\nDev",
  "category": "scenario",
  "isUrgent": false,
  "choices": {
    "1": {
      "name": "1",
      "text": "Ask Dev to reprocess the skipped records immediately.",
      "outcome": {
        "description": "Reprocessing resolves some duplicates but introduces inconsistencies because the root cause isn't fixed yet. Marketing appreciates the quick action, but MDM cautions about sustainability.",
        "impact": {
          "dataQuality": -1,
          "stakeholderTrust": 1,
          "profit": -500
        },
        "next": ["data_4A"]
      }
    },
    "2": {
      "name": "2",
      "text": "Coordinate with Raj from MDM to test a safer targeted rule adjustment before reprocessing.",
      "outcome": {
        "description": "By collaborating with MDM first, you ensure stability. The controlled test prevents new duplicates and earns confidence from both teams.",
        "impact": {
          "dataQuality": 5,
          "stakeholderTrust": 3,
          "profit": 2000
        },
        "next": ["data_4B"]
      }
    },
    "3": {
      "name": "3",
      "text": "Escalate the matter to the Governance Council while IT continues analysis.",
      "outcome": {
        "description": "The Council requests a summary, but your technical teams lose focus while preparing governance materials. Progress slows noticeably.",
        "impact": {
          "dataQuality": -3,
          "stakeholderTrust": -2,
          "profit": -2500
        },
        "next": ["data_4C"]
      }
    }
  }
},

  {
  "name": "data_3C",
  "end": false,
  "sender": "Data Governance Council",
  "title": "Clarification Needed – Duplicate Record Escalation",
  "content": "Dear {first_name},<br/><br/>We received your escalation about duplicate customer records, but your report doesn't include supporting data or system evidence.<br/><br/>Please provide examples of affected records, logs from the last integration cycle, and confirmation of the suspected cause before we can take further action.<br/><br/>In the meantime, Marketing is waiting for your analysis before they proceed with the campaign.<br/><br/>Sincerely,\nData Governance Council Secretariat",
  "category": "scenario",
  "isUrgent": false,
  "choices": {
    "1": {
      "name": "1",
      "text": "Gather the necessary logs and examples, then resubmit your findings to the Council with a clearer report.",
      "outcome": {
        "description": "You provide evidence that helps clarify the situation, but valuable time was lost in documentation. The Council acknowledges your effort, but teams are frustrated by delays.",
        "impact": {
          "dataQuality": 2,
          "stakeholderTrust": -1,
          "profit": -3000
        },
        "next": ["data_4B"]
      }
    },
    "2": {
      "name": "2",
      "text": "Loop in Raj from MDM and Dev from IT to prepare the requested data collectively.",
      "outcome": {
        "description": "Collaboration improves after the initial misstep. You regain partial control of the narrative, though Marketing still questions the delay.",
        "impact": {
          "dataQuality": 4,
          "stakeholderTrust": 1,
          "profit": -1500
        },
        "next": ["data_4B"]
      }
    },
    "3": {
      "name": "3",
      "text": "Reply that you'll send the data once the teams finish their own investigations.",
      "outcome": {
        "description": "The Council interprets your response as deflection, and pressure mounts for quicker action. Marketing starts escalating directly to leadership.",
        "impact": {
          "dataQuality": -3,
          "stakeholderTrust": -5,
          "profit": -4500
        },
        "next": ["data_4C"]
      }
    }
  }
},

  {
  "name": "data_4A",
  "end": false,
  "sender": "Nina Gomez, Compliance Officer",
  "title": "Rollback Completed – Impact on Customer Preferences",
  "content": "Hi {first_name},<br/><br/>We've received reports that some customer contact preferences may have been reset after the MDM rollback. A few customers are now showing outdated consent statuses in Salesforce.<br/><br/>Can you confirm how many records were affected and what the plan is to revalidate the correct information?<br/><br/>This is time-sensitive since our next compliance report is due tomorrow.<br/><br/>Best,\nNina",
  "category": "scenario",
  "isUrgent": true,
  "choices": {
    "1": {
      "name": "1",
      "text": "Acknowledge the issue and coordinate with MDM to identify which records lost preferences.",
      "outcome": {
        "description": "You work closely with MDM to isolate the affected records. Compliance appreciates the transparency, and the impact is limited.",
        "impact": {
          "dataQuality": 3,
          "stakeholderTrust": 4,
          "profit": 1500
        },
        "next": ["data_5A"]
      }
    },
    "2": {
      "name": "2",
      "text": "Inform Compliance that the rollback fixed most issues and that Marketing can proceed as planned.",
      "outcome": {
        "description": "Your reassurance sounds premature. Compliance identifies inconsistencies later and requests a formal incident review.",
        "impact": {
          "dataQuality": -2,
          "stakeholderTrust": -2,
          "profit": -1000
        },
        "next": ["data_5B"]
      }
    },
    "3": {
      "name": "3",
      "text": "Escalate the consent issue to the Governance Council before validating the data.",
      "outcome": {
        "description": "The Council acknowledges the escalation but requests verified evidence. The investigation stalls while awaiting validation.",
        "impact": {
          "dataQuality": 0,
          "stakeholderTrust": -1,
          "profit": -2500
        },
        "next": ["data_5C"]
      }
    }
  }
},

  {
  "name": "data_4B",
  "end": false,
  "sender": "Nina Gomez, Compliance Officer",
  "title": "Customer Data Stabilized – Confirmation Needed",
  "content": "Hi {first_name},<br/><br/>Good progress so far. Marketing confirmed that the duplicates have stopped appearing in Salesforce, and new campaign data looks consistent.<br/><br/>Before we close this out, could you confirm how you're validating that no other customer segments were impacted by the matching rule update?<br/><br/>I'll include your notes in the compliance incident summary for transparency.<br/><br/>Thanks,\nNina",
  "category": "scenario",
  "isUrgent": false,
  "choices": {
    "1": {
      "name": "1",
      "text": "Provide a short report summarizing the validation checks completed and their results.",
      "outcome": {
        "description": "You deliver a clear validation summary showing that the issue is contained. Compliance closes the incident and praises your structured communication.",
        "impact": {
          "dataQuality": 4,
          "stakeholderTrust": 5,
          "profit": 3000
        },
        "next": ["data_5A"]
      }
    },
    "2": {
      "name": "2",
      "text": "Wait for MDM to send you their verification before responding.",
      "outcome": {
        "description": "The verification takes longer than expected. Compliance sends reminders, and confidence slightly declines while waiting.",
        "impact": {
          "dataQuality": 1,
          "stakeholderTrust": -1,
          "profit": -1000
        },
        "next": ["data_5B"]
      }
    },
    "3": {
      "name": "3",
      "text": "Tell Compliance that Marketing has validated the fix and no further checks are needed.",
      "outcome": {
        "description": "Compliance later discovers a few mismatched records. They appreciate your effort but note a missed opportunity for full closure.",
        "impact": {
          "dataQuality": -2,
          "stakeholderTrust": -2,
          "profit": -1500
        },
        "next": ["data_5B"]
      }
    }
  }
},

  {
  "name": "data_4C",
  "end": false,
  "sender": "Nina Gomez, Compliance Officer",
  "title": "Ongoing Duplicate Issues – Customer Complaints Escalating",
  "content": "Hi {first_name},<br/><br/>We're still receiving complaints from Marketing and Customer Support about customers appearing twice in Salesforce. Some even received duplicate test emails this morning.<br/><br/>Can you confirm whether the root cause has been addressed? Compliance needs clarity to assess potential regulatory impact if contact preferences are inconsistent.<br/><br/>Please respond as soon as possible.<br/><br/>Best,\nNina",
  "category": "scenario",
  "isUrgent": true,
  "choices": {
    "1": {
      "name": "1",
      "text": "Acknowledge the issue and commit to providing a detailed update within the day.",
      "outcome": {
        "description": "You take ownership of the situation and re-engage MDM and IT. The response helps contain frustration, though recovery will take more time.",
        "impact": {
          "dataQuality": 1,
          "stakeholderTrust": 1,
          "profit": -1500
        },
        "next": ["data_5B"]
      }
    },
    "2": {
      "name": "2",
      "text": "Tell Compliance that MDM is still investigating and that you'll update once they respond.",
      "outcome": {
        "description": "Your passive response is perceived as deflection. Compliance escalates the matter to Governance, citing lack of proactive ownership.",
        "impact": {
          "dataQuality": -2,
          "stakeholderTrust": -3,
          "profit": -2500
        },
        "next": ["data_5C"]
      }
    },
    "3": {
      "name": "3",
      "text": "Forward Compliance's message directly to MDM and Marketing without comment.",
      "outcome": {
        "description": "The teams feel blindsided and confused by the uncoordinated escalation. Communication breaks down, slowing resolution.",
        "impact": {
          "dataQuality": -4,
          "stakeholderTrust": -6,
          "profit": -4000
        },
        "next": ["data_5C"]
      }
    }
  }
},

  {
  "name": "data_5A",
  "end": false,
  "sender": "Nina Gomez, Compliance Officer",
  "title": "Incident Contained – Compliance Report Finalized",
  "content": "Hi {first_name},<br/><br/>Great news ! The Compliance report was submitted on time, and Marketing confirmed that no duplicate records remain in Salesforce.<br/><br/>Your clear validation report made the closure process smooth, and the Council has noted the effective coordination between teams.<br/><br/>I've shared your summary with the Data Governance Council so they can officially close the incident. Expect a short note from them shortly.<br/><br/>Thanks again for your diligence and collaboration throughout this process.<br/><br/>Best,\nNina",
  "category": "scenario",
  "isUrgent": false,
  "choices": {
    "1": {
      "name": "1",
      "text": "Acknowledge Nina's message and thank her for confirming closure.",
      "outcome": {
        "description": "You close the loop professionally and maintain strong alignment with Compliance. The Council will now send final recognition for exemplary stewardship.",
        "impact": {
          "dataQuality": 6,
          "stakeholderTrust": 5,
          "profit": 2000
        },
        "next": ["data_6A"]
      }
    },
    "2": {
      "name": "2",
      "text": "Forward Nina's message to MDM and Marketing to share the good news.",
      "outcome": {
        "description": "You ensure everyone sees the positive outcome, but you don't personally confirm closure with Compliance. The Council acknowledges your collaboration but sees room for stronger closure communication.",
        "impact": {
          "dataQuality": 6,
          "stakeholderTrust": 4,
          "profit": 2000
        },
        "next": ["data_6B"]
      }
    },
    "3": {
      "name": "3",
      "text": "Acknowledge briefly and move on to your next task.",
      "outcome": {
        "description": "You confirm closure efficiently, but your minimal response appears transactional. The Council closes the case with minor improvement notes.",
        "impact": {
          "dataQuality": 6,
          "stakeholderTrust": 3,
          "profit": 2000
        },
        "next": ["data_6B"]
      }
    }
  }
},

  {
  "name": "data_5B",
  "end": false,
  "sender": "Nina Gomez, Compliance Officer",
  "title": "Incident Stabilized – Validation Still Pending",
  "content": "Hi {first_name},<br/><br/>Thanks for your continued support on the duplicate record issue. The situation has stabilized : Marketing hasn't reported new duplicates, and MDM confirms the fix is holding.<br/><br/>However, a few customer preference records are still flagged for review. The Data Governance Council has asked for a brief post-incident summary before final closure.<br/><br/>Could you confirm if those last checks will be completed this week?<br/><br/>Best regards,\nNina",
  "category": "scenario",
  "isUrgent": false,
  "choices": {
    "1": {
      "name": "1",
      "text": "Commit to finishing the last validations and preparing a short summary for the Council.",
      "outcome": {
        "description": "You commit clearly and regain full confidence from Compliance. The Council will review your final summary before closure and acknowledge your responsible follow-up.",
        "impact": {
          "dataQuality": 3,
          "stakeholderTrust": 2,
          "profit": 500
        },
        "next": ["data_6B"]
      }
    },
    "2": {
      "name": "2",
      "text": "Inform Nina that MDM owns the remaining validations and they'll handle the update.",
      "outcome": {
        "description": "You delegate the task to MDM. While progress continues, your ownership appears reduced in the Council's review. Governance will follow up on accountability.",
        "impact": {
          "dataQuality": 2,
          "stakeholderTrust": -1,
          "profit": 300
        },
        "next": ["data_6B"]
      }
    },
    "3": {
      "name": "3",
      "text": "Acknowledge Nina's message but don't commit to a specific follow-up.",
      "outcome": {
        "description": "Your vague response leaves Compliance uncertain. The Council proceeds with a neutral closure but raises communication as a concern in their review.",
        "impact": {
          "dataQuality": 1,
          "stakeholderTrust": -2,
          "profit": 0
        },
        "next": ["data_6C"]
      }
    }
  }
},

  {
  "name": "data_5C",
  "end": false,
  "sender": "Nina Gomez, Compliance Officer",
  "title": "Escalation Notice – Governance Follow-Up Required",
  "content": "Hi {first_name},<br/><br/>The Data Governance Council has requested an escalation review for the duplicate record incident. It appears that communication gaps and unclear responsibilities slowed resolution and created confusion between Marketing, MDM, and Compliance.<br/><br/>The Council wants a concise summary of what occurred, including timeline, root cause, and key decisions made.<br/><br/>Please prepare your input for their review by Friday.<br/><br/>Best,\nNina",
  "category": "scenario",
  "isUrgent": false,
  "choices": {
    "1": {
      "name": "1",
      "text": "Acknowledge Nina's message and confirm you'll prepare a factual summary for the Council.",
      "outcome": {
        "description": "You take accountability and provide the requested summary. The Council appreciates your professionalism and re-engagement and schedules a governance follow-up session.",
        "impact": {
          "dataQuality": 1,
          "stakeholderTrust": 0,
          "profit": -1500
        },
        "next": ["data_6B"]
      }
    },
    "2": {
      "name": "2",
      "text": "Forward Nina's message to MDM and ask them to provide input first.",
      "outcome": {
        "description": "You defer the task, causing delays. The Council receives incomplete information and expresses concern about lack of ownership.",
        "impact": {
          "dataQuality": -3,
          "stakeholderTrust": -2,
          "profit": -2000
        },
        "next": ["data_6C"]
      }
    },
    "3": {
      "name": "3",
      "text": "Do not reply immediately, assuming your manager will handle the Council response.",
      "outcome": {
        "description": "The delayed response frustrates Compliance and the Council. The issue is escalated as a governance communication failure.",
        "impact": {
          "dataQuality": -3,
          "stakeholderTrust": -4,
          "profit": -2500
        },
        "next": ["data_6C"]
      }
    }
  }
},


  {
  "name": "data_6A",
  "end": true,
  "sender": "Data Office – Governance and Quality",
  "title": "Case Closed – Exemplary Data Stewardship Recognized",
  "content": "Hi {first_name},<br/><br/>The Data Governance Council has officially closed the 'Duplicate Identities' case. Your leadership, clear communication, and coordination across MDM, Marketing, and Compliance ensured a fast, accurate, and sustainable resolution.<br/><br/>Your validation report and structured communication set a new benchmark for data stewardship within the organization. The Council particularly appreciates your focus on root-cause prevention and transparency throughout the process.<br/><br/>Your case summary will be shared internally as a best-practice example in the upcoming Data Quality Forum.<br/><br/>Congratulations and thank you for your commitment to trusted, well-governed data.<br/><br/>Sincerely,\nThe Data Office",
  "category": "scenario",
  "isUrgent": false,
  "choices": {
    "1": {
      "name": "1",
      "text": "Acknowledge the recognition and thank the Council for their feedback.",
      "outcome": {
        "description": "You graciously thank the Council and your collaborators. The case is officially closed with distinction and your stewardship reputation increases across domains.",
        "impact": {
          "dataQuality": 10,
          "stakeholderTrust": 10,
          "profit": 5000
        },
        "next": []
      }
    },
    "2": {
      "name": "2",
      "text": "Share the recognition with your MDM and Marketing colleagues.",
      "outcome": {
        "description": "You share the recognition with others, reinforcing collaboration and culture of shared ownership in data quality.",
        "impact": {
          "dataQuality": 10,
          "stakeholderTrust": 8,
          "profit": 5000
        },
        "next": []
      }
    },
    "3": {
      "name": "3",
      "text": "Acknowledge briefly and move on to your next task.",
      "outcome": {
        "description": "You close the case efficiently but miss a moment to reinforce visibility of your success. Still, your record stands strong.",
        "impact": {
          "dataQuality": 10,
          "stakeholderTrust": 7,
          "profit": 5000
        },
        "next": []
      }
    }
  }
},

  {
  "name": "data_6B",
  "end": true,
  "sender": "Data Office – Governance and Quality",
  "title": "Case Closed – Good Resolution with Recommendations",
  "content": "Hi {first_name},<br/><br/>The Data Governance Council has closed the 'Duplicate Identities' case. The outcome was positive, and your work helped restore data consistency across systems.<br/><br/>However, the Council noted that post-incident validation or communication with Compliance could have been completed more promptly. To strengthen future responses, we recommend adopting a short closure checklist for incident documentation.<br/><br/>Your proactive collaboration with MDM and Marketing was appreciated and helped avoid wider customer impact.<br/><br/>Thank you for your continued commitment to data stewardship.<br/><br/>Sincerely,\nThe Data Office",
  "category": "scenario",
  "isUrgent": false,
  "choices": {
    "1": {
      "name": "1",
      "text": "Acknowledge the feedback and commit to adopting a closure checklist for future incidents.",
      "outcome": {
        "description": "You accept the feedback constructively and propose an improvement. The Council praises your accountability and growth mindset.",
        "impact": {
          "dataQuality": 6,
          "stakeholderTrust": 6,
          "profit": 3000
        },
        "next": []
      }
    },
    "2": {
      "name": "2",
      "text": "Acknowledge the message and thank the Council for the closure.",
      "outcome": {
        "description": "You respond courteously and confirm closure. The Council closes the case but notes opportunity for better governance communication.",
        "impact": {
          "dataQuality": 6,
          "stakeholderTrust": 4,
          "profit": 3000
        },
        "next": []
      }
    },
    "3": {
      "name": "3",
      "text": "Do not reply and move on to your next case.",
      "outcome": {
        "description": "The case closes automatically. The Council records the resolution as satisfactory but notes lack of engagement in governance follow-up.",
        "impact": {
          "dataQuality": 6,
          "stakeholderTrust": 3,
          "profit": 2000
        },
        "next": []
      }
    }
  }
},

  {
  "name": "data_6C",
  "end": true,
  "sender": "Data Office – Governance and Quality",
  "title": "Governance Review – Follow-Up Required on Escalation Process",
  "content": "Hi {first_name},<br/><br/>The Data Governance Council has completed its review of the 'Duplicate Identities' incident. The findings show that unclear ownership and delayed coordination prolonged the resolution and increased compliance risk.<br/><br/>While the issue was eventually contained, the Council recommends defining clearer escalation paths and accountability checkpoints for future incidents.<br/><br/>Please prepare a short corrective action proposal summarizing your recommendations for improvement by the end of the week.<br/><br/>Sincerely,\nThe Data Office",
  "category": "scenario",
  "isUrgent": false,
  "choices": {
    "1": {
      "name": "1",
      "text": "Acknowledge the feedback and commit to drafting a corrective action proposal.",
      "outcome": {
        "description": "You take ownership and commit to process improvement. The Council values your constructive approach and re-engagement.",
        "impact": {
          "dataQuality": 3,
          "stakeholderTrust": 3,
          "profit": 1500
        },
        "next": []
      }
    },
    "2": {
      "name": "2",
      "text": "Thank the Council and note that MDM or IT teams should lead the improvement plan.",
      "outcome": {
        "description": "You deflect partial responsibility, and the Council reminds you that stewardship includes coordination. The case remains open for review.",
        "impact": {
          "dataQuality": 2,
          "stakeholderTrust": -2,
          "profit": -1000
        },
        "next": []
      }
    },
    "3": {
      "name": "3",
      "text": "Do not reply and wait for your manager to respond instead.",
      "outcome": {
        "description": "The lack of response confirms concerns about ownership. The Council plans a mandatory review session to address accountability.",
        "impact": {
          "dataQuality": 0,
          "stakeholderTrust": -4,
          "profit": -2500
        },
        "next": []
      }
    }
  }
},
  {
  "name": "data_extra_1",
  "end": false,
  "default": false,
  "sender": "Leo Grant, Head of Sales Operations",
  "title": "Input Needed : Evaluating Data Enrichment Vendor",
  "content": "Hi {first_name},<br/><br/>We're reviewing potential vendors to enrich customer data in Salesforce — things like company size, industry, and revenue.<br/><br/>From a data governance perspective, are there best practices or risks we should be aware of before integrating a third-party enrichment source?<br/><br/>Thanks,<br/>Leo",
  "category": "sales_support",
  "isUrgent": false,
  "choices": {
    "1": {
      "name": "1",
      "text": "Advise Leo to ensure the vendor's data sources comply with company governance and MDM standards.",
      "outcome": {
        "description": "You provide solid governance advice and help Sales Ops prepare the right vendor questions. They appreciate your foresight.",
        "impact": {
          "dataQuality": 0,
          "stakeholderTrust": 1,
          "profit": 0
        },
        "next": ["data_extra_2"]
      }
    },
    "2": {
      "name": "2",
      "text": "Share that enrichment tools can be helpful, but recommend testing the data quality before integration.",
      "outcome": {
        "description": "Leo notes your caution and agrees to include a quality check phase. Collaboration remains positive.",
        "impact": {
          "dataQuality": 1,
          "stakeholderTrust": 1,
          "profit": 0
        },
        "next": ["data_extra_2"]
      }
    },
    "3": {
      "name": "3",
      "text": "Mention that enrichment tools usually improve coverage and let them proceed.",
      "outcome": {
        "description": "Your quick response speeds things up, but governance later flags missing due diligence documentation.",
        "impact": {
          "dataQuality": -1,
          "stakeholderTrust": -1,
          "profit": -1000
        },
        "next": ["data_extra_2"]
      }
    }
  }
},
  {
  "name": "data_extra_2",
  "end": false,
  "default": false,
  "sender": "Sara Nguyen, Sales Performance Analyst",
  "title": "Definition of 'Active Customer'",
  "content": "Hi {first_name},<br/><br/>I'm preparing the quarterly customer retention dashboard, and I'd like to confirm our definition of 'Active Customer'. Some systems label a record as active if it has an open opportunity, while others rely on MDM's status field.<br/><br/>Which definition should we use for the official report?<br/><br/>Thanks,<br/>Sara",
  "category": "sales_support",
  "isUrgent": false,
  "choices": {
    "1": {
      "name": "1",
      "text": "Explain that MDM's 'Customer Status' is the master definition and aligns with governance rules.",
      "outcome": {
        "description": "Sara thanks you and updates the report accordingly, improving consistency across teams.",
        "impact": {
          "dataQuality": 1,
          "stakeholderTrust": 1,
          "profit": 0
        },
        "next": ["data_extra_3"]
      }
    },
    "2": {
      "name": "2",
      "text": "Suggest using the definition from Salesforce since it reflects current sales activity.",
      "outcome": {
        "description": "Sara aligns with Sales data, but Marketing later raises concerns about inconsistency with governance reports.",
        "impact": {
          "dataQuality": -1,
          "stakeholderTrust": -1,
          "profit": 0
        },
        "next": ["data_extra_3"]
      }
    },
    "3": {
      "name": "3",
      "text": "Advise using both definitions side by side for comparison.",
      "outcome": {
        "description": "Sara appreciates the nuance but finds it confusing for the official dashboard audience.",
        "impact": {
          "dataQuality": 0,
          "stakeholderTrust": -1,
          "profit": 0
        },
        "next": ["data_extra_3"]
      }
    }
  }
},

  {
  "name": "data_extra_3",
  "end": false,
  "default": false,
  "sender": "HR Events Team",
  "title": "Invitation Sales & Data Team Building Afternoon",
  "content": "Hi {first_name},<br/><br/>We're organizing a joint team-building event for Sales, Marketing, and Data teams next Thursday afternoon at the Innovation Hub.<br/><br/>Activities include a short escape-room challenge, followed by snacks and networking. Please RSVP by Monday if you can attend.<br/><br/>Best,<br/>HR Events Team",
  "category": "culture",
  "isUrgent": false,
  "choices": {
    "1": {
      "name": "1",
      "text": "Accept the invitation and encourage your data colleagues to join.",
      "outcome": {
        "description": "You confirm attendance and help foster better relationships between Sales and Data. Cross-team trust improves slightly.",
        "impact": {
          "dataQuality": 0,
          "stakeholderTrust": 1,
          "profit": 0
        },
        "next": []
      }
    },
    "2": {
      "name": "2",
      "text": "Politely decline due to workload, but thank HR for the invitation.",
      "outcome": {
        "description": "You skip the event but maintain professionalism. No real impact on relationships.",
        "impact": {
          "dataQuality": 0,
          "stakeholderTrust": 0,
          "profit": 0
        },
        "next": []
      }
    },
    "3": {
      "name": "3",
      "text": "Ignore the invitation : you're too busy with data cleanup tasks.",
      "outcome": {
        "description": "Your absence is noticed, and a few Sales colleagues comment that Data never joins social events.",
        "impact": {
          "dataQuality": 0,
          "stakeholderTrust": -1,
          "profit": 0
        },
        "next": []
      }
    }
  }
}
],

  "indicators": [
    {"name": "Profit", "nameId": "profit", "emoji": "📈", "initial": 0, "min": -10000000, "max": 10000000, "type": "dollars", "displayed": true, "color": "primary"},
    {"name": "Data Quality", "nameId": "dataQuality", "emoji": "📊", "initial": 50, "min": 0, "max": 100, "type": "percentage", "displayed": true, "color": "primary"},
    {"name": "Stakeholder Trust", "nameId": "stakeholderTrust", "emoji": "🤝", "initial": 50, "min": 0, "max": 100, "type": "percentage", "displayed": true, "color": "secondary"},
    {"name": "CDO Budget", "nameId": "cdoBudget", "emoji": "💰", "initial": 1000000, "min": 0, "max": 10000000, "type": "dollars", "displayed": false, "color": "#9c27b0"},
    {"name": "Reputation", "nameId": "reputation", "emoji": "⭐", "initial": 50, "min": 0, "max": 100, "type": "percentage", "displayed": false, "color": "#9c27b0"}
  ],
  "termsLinks":[
    {
      "name": "MDM",
      "text": "MDM definition",
      "href": "mdm.html",
      "source": "local"
    },
    {
      "name": "matching rules",
      "text": "Matching rules definition",
      "href": "mdm.html",
      "source": "local"
    },
    {
      "name": "matching rule",
      "text": "Matching rule definition",
      "href": "mdm.html",
      "source": "local"
    },
    { "name": "2",
      "text": "Matching rules definition",
      "href": "mdm.html",
      "source": "local"
    },
    { "name": "2",
      "text": "Matching logic definition",
      "href": "mdm.html",
      "source": "local"
    }
  ],
   
  "endResources": [
    {
      "name": "2",
      "text": "The big confusion about Data Governance roles",
      "href": "big_confusion_about_data_governance_roles.html",
      "source": "local"
    },
    {
      "name": "3",
      "text": "MDM definition",
      "href": "mdm.html",
      "source": "local"
    }
  ],

  "logo": {"assetId": "data_steward.png"},
  "logoId": "trouble_in_the_mdm",
  "headerGameText": "Data Steward Simulator",
  "title": "Trouble in the MDM",
  "scenarioTitle": "Trouble in the MDM",
  "cdoRole": "Your Role as Data Steward",
  "plan": "pro",
  "role": "Data Steward",
  "gameTitle": "Data Steward Simulator",
  "introText": "Welcome to the <b>Data Steward Simulator</b>, a training environment that mirrors real-life data governance challenges. <br/><br/>In this simulation, you'll take the role of the **Customer Data Steward**, working within the **Sales team**, the business owner of customer data.<br/><br/>Recently, the Marketing team reported a serious issue : they found duplicate customer records... <br/><br/>You're the **Data Steward** responsible for investigating and restoring data trust without disrupting daily operations.",
  "description": "In this simulation, you'll take the role of the **Customer Data Steward**, working within the **Sales team**, the business owner of customer data.<br/><br/>Recently, the Marketing team reported a serious issue : they found duplicate customer records... <br/><br/>You're the **Data Steward** responsible for investigating and restoring data trust without disrupting daily operations.",
  "logoCompany": {"assetId": "maketools_logo.png"},
  "startTutorial": "🔎 <b>Investigate the impact</b> : identify what is affected and root causes.\n 🧹 <b>Coordinate the cleanup</b> : decide how to fix the issue and who to involve.\n🤝  <b>Restore trust</b> : maintain your credibility with stakeholders."
}
