{
  "nodes": [
    {
      "name": "urgent_potential_data_breach_detected",
      "end": false,
      "default": true,
      "sender": "CISO Office",
      "title": "[URGENT] Potential Data Breach Detected",
      "content": "Our security monitoring system has detected unusual access patterns to your customer database. Initial investigation suggests unauthorized access to approximately 10,000 customer records. We need your immediate guidance on how to proceed with this potential breach",
      "category": "dataBreach",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Immediately shut down all affected systems to prevent further access",
          "outcome": {
            "description": "You've contained the breach quickly, but business operations were disrupted for 4 hours. The rapid response prevented further data exposure.",
            "impact": {
              "profit": -400000,
              "dataQuality": 0,
              "cdoBudget": -100000,
              "clientRelationship": -30
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Continue monitoring while our team investigates the extent of the breach",
          "outcome": {
            "description": "The continued monitoring revealed it was a false alarm triggered by a new analytics tool. Your measured approach avoided unnecessary disruption.",
            "impact": {
              "profit": 0,
              "dataQuality": -15,
              "cdoBudget": -200000,
              "clientRelationship": -20
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Notify affected customers immediately while investigation continues",
          "outcome": {
            "description": "Your transparency was appreciated by customers, but it caused significant concern. Further investigation revealed the breach was much smaller than initially thought, making your response seem somewhat excessive.",
            "impact": {
              "profit": -300000,
              "dataQuality": -5,
              "cdoBudget": -200000,
              "clientRelationship": -25
            },
            "next": []
          }
        }
      },
      "minClientRelationship": 20,
      "maxDataQuality": 60
    },
    {
      "name": "urgent_data_breach_confirmed",
      "end": false,
      "default": false,
      "sender": "Security Operations",
      "title": "[URGENT] Data Breach Confirmed",
      "content": "We have confirmed unauthorized access to your project data. The breach appears to have exposed data obtained in a community engagement survey including names, addresses, and phone numbers of approximately 500 members of the public. Law enforcement has been notified, but we need your decision on public disclosure.",
      "category": "dataBreach",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Issue immediate public statement and notify all affected members of the public",
          "outcome": {
            "description": "Your rapid and transparent response earned praise from privacy advocates and regulators. While there was short-term negative press, the long-term damage to company reputation was minimized.",
            "impact": {
              "profit": -150000,
              "dataQuality": 0,
              "cdoBudget": -150000,
              "clientRelationship": -20
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Quietly notify those directly affected  while completing the investigation",
          "outcome": {
            "description": "Your targeted approach contained initial panic, but a whistleblower leaked the breach to the press, causing accusations of a cover-up. The controlled initial response was overshadowed by the perception of secrecy.",
            "impact": {
              "profit": -300000,
              "dataQuality": 0,
              "cdoBudget": -400000,
              "clientRelationship": -30
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Delay all notifications for 48 hours until we have complete information",
          "outcome": {
            "description": "The delay allowed your team to develop a comprehensive response, but it violated regulatory requirements for timely notification. The company faces potential fines for the delayed reporting.",
            "impact": {
              "profit": -500000,
              "dataQuality": 0,
              "cdoBudget": -100000,
              "clientRelationship": -15
            },
            "next": []
          }
        }
      },
      "minClientRelationship": 35,
      "maxDataQuality": 70
    },
    {
      "name": "urgent_thirdparty_vendor_data_breach",
      "end": false,
      "default": false,
      "sender": "Legal Department",
      "title": "[URGENT] Third-party Vendor Data Breach",
      "content": "We've just been informed that one of our cloud service providers has experienced a significant data breach. They believe data from your current project may have been compromised. As the data controller, we have legal obligations regardless of the breach occurring out of our environment.",
      "category": "dataBreach",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Demand the vendor handle all notifications and remediation",
          "outcome": {
            "description": "The vendor's poor communication and slow response reflected badly on Arup. Customers are angry that you attempted to shift responsibility, and regulators question your vendor management practices.",
            "impact": {
              "profit": -100000,
              "dataQuality": 0,
              "cdoBudget": 0,
              "clientRelationship": -30
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Take control of the response and work closely with Arup's Legal team to establish a way forward.",
          "outcome": {
            "description": "Your proactive approach demonstrated strong customer focus but excluding the vendor increased Arup's costs substantially. The vendor has agreed to partial cost reimbursement, but the incident has strained the relationship.",
            "impact": {
              "profit": -200000,
              "dataQuality": 0,
              "cdoBudget": -150000,
              "clientRelationship": -10
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Notify your Legal Team and share the contractual obligations with them. Set up a meeting with the Legal Team and the Vendor to form a joint response strategy.",
          "outcome": {
            "description": "The collaborative approach balanced responsibilities effectively. Customers appreciated the unified and comprehensive response, while costs were shared appropriately between both companies.",
            "impact": {
              "profit": -100000,
              "dataQuality": 0,
              "cdoBudget": -300000,
              "clientRelationship": -5
            },
            "next": []
          }
        }
      },
      "minClientRelationship": 5,
      "maxDataQuality": 40
    },
    {
      "name": "urgent_data_subject_access_request",
      "end": false,
      "default": false,
      "sender": "Legal Team",
      "title": "[URGENT] Data Subject Access Request",
      "content": "We've received a Data Subject Access Request about the data your client holds about certain subcontractors. As we work closely with them we have to respond. Can you share a copy of any data you have relating to those listed in the request?",
      "category": "dataBreach",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Use Copilot to quickly search through our documentation and send through the results to the third-party that made the request.",
          "outcome": {
            "description": "The data was received but the quality and validity of the data was further questioned. This created follow up requests and there are concerns about our data and security practices.",
            "impact": {
              "profit": 0,
              "dataQuality": 0,
              "cdoBudget": -5000000000,
              "clientRelationship": -30
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Notify the Cyber Secuirty and Legal Team and work closely with them to ensure the data you provide is complete and appropriate.",
          "outcome": {
            "description": "The Data Subject Access Request was successfully fulfilled but took longer than expected. Your project delivery operations were impacted, but Arup's business integrity remains intact with industry peers",
            "impact": {
              "profit": -2000000000,
              "dataQuality": 0,
              "cdoBudget": -1000000000,
              "clientRelationship": -10
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Notify the Cyber Secuirty and Legal Team and become an active advocate for reshaping the governance framework surrounding data obtained through subcontractors.",
          "outcome": {
            "description": "The Data Subject Access Request was successfully fulfilled but took longer than expected. Your work reshaping the governance frameworks positivly impacted exposure to risk but took time away from your project work.",
            "impact": {
              "profit": -1500000000,
              "dataQuality": 0,
              "cdoBudget": -2500000000,
              "clientRelationship": 5
            },
            "next": []
          }
        }
      },
      "minClientRelationship": 40,
      "maxDataQuality": 70
    },
    {
      "name": "budget_approved_keep_modernizing_our_data_infrastructure",
      "end": false,
      "default": false,
      "sender": "CEO Office",
      "title": "Budget Approved: Keep Modernizing Our Data Infrastructure",
      "content": "Thanks to your team’s work improving our data pipeline efficiency, we’re in a strong position to upgrade our data systems. I’ve approved additional budget to modernize our customer, product, and risk data pipelines. I'd like you to work with the team to improve our systems. Choose your path.",
      "category": "budget",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Influence the team to deploy a full modern data stack across all business units",
          "outcome": {
            "description": "Marketing, sales, and compliance teams run faster and smarter, but further upskilling for Arup members is required.",
            "impact": {
              "profit": 100000,
              "dataQuality": -10,
              "cdoBudget": 500000,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Volunteer to pilot new architecture with your customer's project data first",
          "outcome": {
            "description": "You validate improvements with real results in one key area.",
            "impact": {
              "profit": 200000,
              "dataQuality": 8,
              "cdoBudget": 300000,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Join the council working to improve Arup's legacy systems incrementally",
          "outcome": {
            "description": "Small gains, but big on quality improvements. Older systems remain a bottleneck.",
            "impact": {
              "profit": 50000,
              "dataQuality": 15,
              "cdoBudget": 150000,
              "clientRelationship": 0
            },
            "next": []
          }
        }
      },
      "minClientRelationship": 50,
      "maxDataQuality": 100
    },
    {
      "name": "budget_released_for_managing_your_sensitive_data",
      "end": false,
      "default": false,
      "sender": "CDO",
      "title": "Budget Released for Managing Your Sensitive Data",
      "content": "With increasing data usage across all projects, we need to secure our systems. I’ve released additional funds to strengthen data recovery and backup: how would you recommend we use them.",
      "category": "budget",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Recommend Arup partner with a dedicated disaster recovery vendor",
          "outcome": {
            "description": "This agreement fully protects customer data only with industry-best SLAs.",
            "impact": {
              "profit": 300000,
              "dataQuality": -10,
              "cdoBudget": 500000,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Support DTG in developing internal safeguards for critical data.",
          "outcome": {
            "description": "Stronger systems in-house, though some risk remains.",
            "impact": {
              "profit": 150000,
              "dataQuality": 10,
              "cdoBudget": 300000,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Recommend Arup delays work on protection and focuses on data quality issues.",
          "outcome": {
            "description": "Savings now for quality, but risk increased exposure during peak periods.",
            "impact": {
              "profit": 50000,
              "dataQuality": 18,
              "cdoBudget": 100000,
              "clientRelationship": 0
            },
            "next": []
          }
        }
      },
      "minClientRelationship": 80,
      "maxDataQuality": 100
    },
    {
      "name": "good_news_bid_success",
      "end": false,
      "default": false,
      "sender": "CEO Office",
      "title": "Good News: Bid Success!",
      "content": "You've just won a big and the client referenced how impressed they were with your inclusion of Data and AI.",
      "category": "budget",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Celebrate your succes and decide how your project budget could be best utilised.",
          "outcome": {
            "description": "You take a deep breath and start planning your next moves.",
            "impact": {
              "profit": 0,
              "dataQuality": 0,
              "cdoBudget": 300000,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Set up your team with a dedicated digital expert who is brought into design conversations early on.",
          "outcome": {
            "description": "Data and AI appoaches are incorporated into your project, but you can do more.",
            "impact": {
              "profit": 0,
              "dataQuality": 6,
              "cdoBudget": 200000,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Allocate significant project budget into new and innovative Data and AI approaches to showcase just what is possible.",
          "outcome": {
            "description": "Arup's data practices and quality improve because of your pioneering approach. Not all of your endeavours are successful or deemed necessary by the client however.",
            "impact": {
              "profit": 0,
              "dataQuality": 10,
              "cdoBudget": 100000,
              "clientRelationship": -5
            },
            "next": []
          }
        }
      },
      "minClientRelationship": 10,
      "maxDataQuality": 100
    },
    {
      "name": "time_to_build_our_data__ai_future",
      "end": false,
      "default": false,
      "sender": "CEO Office",
      "title": "Time to Build Our Data & AI Future",
      "content": "You've been invited to attend the next Leading Digital Change - Data & AI programme which starts soon. It's a great opportunity for you to boost your knowledge and understanding of how you can lead Arup to a Data and AI powered future. Can you attend?",
      "category": "budget",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Carve out some time to attend the next cohort. This could be a game-changer!",
          "outcome": {
            "description": "You collaborate with other Directors and gain a core understanding of what it means to be a Data-led organisation.",
            "impact": {
              "profit": 400000,
              "dataQuality": 5,
              "cdoBudget": 500000,
              "clientRelationship": -5
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Delay your decision until the next cohort - focus on your project delivery for now. Attend some of the open alumni talks to better understand the programme.",
          "outcome": {
            "description": "Your project work benefits but your grasp of digital practices is being left behind.",
            "impact": {
              "profit": 100000,
              "dataQuality": 2,
              "cdoBudget": 400000,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Decline the invite and focus solely on your project.",
          "outcome": {
            "description": "This is the safe option in the short term, but Arup risk's falling behind - and what are the consequences?",
            "impact": {
              "profit": 0,
              "dataQuality": 0,
              "cdoBudget": 1000000000,
              "clientRelationship": 5
            },
            "next": []
          }
        }
      },
      "minClientRelationship": 60,
      "maxDataQuality": 100
    },
    {
      "name": "the_digital_transformation_of_arup",
      "end": false,
      "default": false,
      "sender": "Group Director",
      "title": "The Digital Transformation of Arup",
      "content": "You've been identified as one of thought leader on AI in the company. I’ve carved out resources for you to lead our AI push : productivity tools, tasks automation, etc. Run with it.",
      "category": "budget",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Launch a full-scale AI program across the organization",
          "outcome": {
            "description": "",
            "impact": {
              "profit": 0,
              "dataQuality": 0,
              "cdoBudget": 0,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Start with a focused AI pilot in your team to begin with and gather \"lessons learned\".",
          "outcome": {
            "description": "",
            "impact": {
              "profit": 0,
              "dataQuality": 0,
              "cdoBudget": 0,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Prioritise finding specific tools and resources for your team now and wait for the wider business to catch up.",
          "outcome": {
            "description": "",
            "impact": {
              "profit": 0,
              "dataQuality": 0,
              "cdoBudget": 0,
              "clientRelationship": 0
            },
            "next": []
          }
        }
      },
      "minClientRelationship": null,
      "maxDataQuality": null
    },
    {
      "name": "lets_empower_everyone_with_data",
      "end": false,
      "default": false,
      "sender": "CDO",
      "title": "Let’s Empower Everyone With Data",
      "content": "All Arup members need to speak data. I’m unlocking funds so all of your team can complete the Introduction to Data course. Let’s build a culture of data fluency together.",
      "category": "budget",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Complete the course and ask your team to do the same as soon as possible.",
          "outcome": {
            "description": "Members across Arup have the same base understanding and are empowered to collaborate on data-related issues.",
            "impact": {
              "profit": 250000,
              "dataQuality": 5,
              "cdoBudget": 600000,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Create tailored internal workshops to upskill your team",
          "outcome": {
            "description": "Your team builds specialised capacity over time at lower cost, but isn't as connected to the wider firm as it could be.",
            "impact": {
              "profit": 400000,
              "dataQuality": 2,
              "cdoBudget": 250000,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Use the time and budget elsewhere and delay the training.",
          "outcome": {
            "description": "You save now for other issues, but miss the chance to scale data literacy.",
            "impact": {
              "profit": 1000000,
              "dataQuality": 1,
              "cdoBudget": 50000,
              "clientRelationship": 5
            },
            "next": []
          }
        }
      },
      "minClientRelationship": 70,
      "maxDataQuality": 100
    },
    {
      "name": "commercial_models_for_our_data",
      "end": false,
      "default": false,
      "sender": "DSP",
      "title": "Commercial Models for our Data",
      "content": "We're interested in exploring opportunities to monetize our data assets. This could create new revenue streams but there are issues around customer privacy and data usage. How should you approach future projects?",
      "category": "strategy",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Engage Digital Services Portfolio for all new projects. Collaborate to create anonymized data products for industry benchmarking.",
          "outcome": {
            "description": "The benchmarking products have generated significant new revenue with minimal privacy concerns. Customers have responded positively to the industry insights they receive in return for data sharing.",
            "impact": {
              "profit": 800000,
              "dataQuality": 0,
              "cdoBudget": 350000,
              "clientRelationship": 20
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Work with Digital Services Portfolio on select projects to develop APIs for partners to access select data with customer consent.",
          "outcome": {
            "description": "The API program has created a vibrant ecosystem of partners and developers. While implementation was complex, it has positioned the company as a platform leader in the industry.",
            "impact": {
              "profit": 100000,
              "dataQuality": -5,
              "cdoBudget": -500000,
              "clientRelationship": 15
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Work with the Digital Technology Group and focus on using our internal data to improve existing products instead of monetization.",
          "outcome": {
            "description": "Your cautious approach has avoided potential privacy pitfalls. While no new revenue streams were created, improved products have increased customer satisfaction and retention.",
            "impact": {
              "profit": 500000,
              "dataQuality": 10,
              "cdoBudget": -200000,
              "clientRelationship": 10
            },
            "next": []
          }
        }
      },
      "minClientRelationship": 50,
      "maxDataQuality": 100
    },
    {
      "name": "community_engagement_survey_data",
      "end": false,
      "default": false,
      "sender": "Team Member - Data Engineer",
      "title": "Community Engagement Survey Data",
      "content": "As part of our current project, I’ve been asked to conduct a community engagement survey to gather feedback from local stakeholders. I want to make sure we’re handling the resulting data correctly from the outset.\nCould you please advise where the survey data should be stored? Is it acceptable to keep it within our standard project files, or should we use a different location to ensure compliance with our data governance requirements?\nThanks for your guidance.",
      "category": "strategy",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Encrypt and store in a secure cloud location with restricted access.",
          "outcome": {
            "description": "The cloud approach simplified operations and reduced costs through volume discounts. However, some vendor lock-in concerns have emerged as pricing models evolved.",
            "impact": {
              "profit": 800000,
              "dataQuality": -10,
              "cdoBudget": 300000,
              "clientRelationship": -5
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Store data on the project site and ensure document is tagged with personal data meta data",
          "outcome": {
            "description": "Data sensitive data on the project site provides flexibility and control and avoids some costs but increases operational complexity.",
            "impact": {
              "profit": 1000000,
              "dataQuality": -20,
              "cdoBudget": -350000,
              "clientRelationship": -5
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "OPTION FOR A HYBRID ?",
          "outcome": {
            "description": "The hybrid approach provided a balanced solution that satisfied security and compliance requirements. The cost savings were moderate, but the risk reduction was significant.",
            "impact": {
              "profit": 600000,
              "dataQuality": 5,
              "cdoBudget": -250000,
              "clientRelationship": 10
            },
            "next": []
          }
        }
      },
      "minClientRelationship": 30,
      "maxDataQuality": 100
    },
    {
      "name": "contract_negotiation",
      "end": false,
      "default": false,
      "sender": "Legal Team",
      "title": "Contract Negotiation",
      "content": "The client has raised that they expect [x] …[y] but the contract says [w] what should you do?",
      "category": "strategy",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Review the contract terms carefully and engage in a formal discussion with the client to clarify expectations and update the pricing with new demand.",
          "outcome": {
            "description": "",
            "impact": {
              "profit": 0,
              "dataQuality": 0,
              "cdoBudget": 0,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Incorporate the client's expectations into your work to maintain goodwill and increase the chance of further future work.",
          "outcome": {
            "description": "",
            "impact": {
              "profit": 0,
              "dataQuality": 0,
              "cdoBudget": 0,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Proceed as per the existing contract - the contract is there to protect both parties and should be upheld in any case.",
          "outcome": {
            "description": "",
            "impact": {
              "profit": 0,
              "dataQuality": 0,
              "cdoBudget": 0,
              "clientRelationship": 0
            },
            "next": []
          }
        }
      },
      "minClientRelationship": null,
      "maxDataQuality": null
    },
    {
      "name": "welcome_aboard",
      "end": false,
      "default": false,
      "sender": "CEO",
      "title": "Welcome aboard!",
      "content": "Dear Project Director,\nAs you know, Arup has some major data challenges and they're are a growing concern as we try to become a Data and AI powered organisation. We've been working on a new strategy to improve our data situation, and we'd love your input. What's your first move?",
      "category": "strategy",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Engage your teams and peers to survey Arup's data needs.",
          "outcome": {
            "description": "You gain insights into current gaps and build goodwill.",
            "impact": {
              "profit": 0,
              "dataQuality": 0,
              "cdoBudget": 30000,
              "clientRelationship": 10
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Meet directly with execs to understand priorities",
          "outcome": {
            "description": "You align with leadership but miss grassroots issues.",
            "impact": {
              "profit": 0,
              "dataQuality": 0,
              "cdoBudget": -50000,
              "clientRelationship": 15
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Review existing dashboards and past data-related reports to establish a sense of the situation",
          "outcome": {
            "description": "You identify a few red flags but miss team engagement.",
            "impact": {
              "profit": 50000,
              "dataQuality": 5,
              "cdoBudget": 0,
              "clientRelationship": 0
            },
            "next": []
          }
        }
      },
      "minClientRelationship": 0,
      "maxDataQuality": 100
    },
    {
      "name": "your_next_hire",
      "end": false,
      "default": false,
      "sender": "???",
      "title": "Your Next Hire",
      "content": "You are working with a team on a new bid. The RFP outlines the need for substantial data services as part of the work. Do you want a data engineer, analyst, or governance expert?",
      "category": "hr",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Hire a data engineer",
          "outcome": {
            "description": "Data infrastructure details start to shape up quickly, but your Data Engineer misses some potential ????",
            "impact": {
              "profit": 500000,
              "dataQuality": 10,
              "cdoBudget": 150000,
              "clientRelationship": -5
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Hire a data analyst",
          "outcome": {
            "description": "You get quick wins with examples of visual insights that can be included.",
            "impact": {
              "profit": 400000,
              "dataQuality": 5,
              "cdoBudget": -120000,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Hire a data governance specialist",
          "outcome": {
            "description": "Your Data processes improve and you put yourself in a good position to make the most of the opportunity, but results are slow to show ?????",
            "impact": {
              "profit": 300000,
              "dataQuality": 10,
              "cdoBudget": -200000,
              "clientRelationship": 5
            },
            "next": []
          }
        }
      },
      "minClientRelationship": 0,
      "maxDataQuality": 100
    },
    {
      "name": "arup_projects_data",
      "end": false,
      "default": false,
      "sender": "CRM Team",
      "title": "Arup Projects Data",
      "content": "Your recent project has been assigned \"confirmed\" status in the CRM system and an Arup Projects Page has been created for it.\nThe project has just started and the initial data is automatically populated with information from CRM.\nThis may have changed since you completed the opportunity report and we encourage you to visit the Arup Projects page now to update this information.\nArup Projects is a central location where you and your team can quickly and easily record, update, amend, share and search for project information across Arup globally.\nPlease update your project information.\nCRM Team.",
      "category": "dataQuality",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Organise a team meeting to review your project data focussing on getting as much accuracy into the system at this point to avoid having to repeat the task.",
          "outcome": {
            "description": "The quick fix improved data quality issues but doesn't address the challenge of having consinutously accurate project data to support other bids/projects.",
            "impact": {
              "profit": 50000,
              "dataQuality": 5,
              "cdoBudget": 100000,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Put in a team meeting to review the data at the end of the quarter when a more accurate set of records can be added.",
          "outcome": {
            "description": "This approach ensured that accurate project data was eventually included into Arup Projects. Other teams missed out on your data in the interim but ultimately received more accurate data than in previous quarters.",
            "impact": {
              "profit": 250000,
              "dataQuality": 10,
              "cdoBudget": -200000,
              "clientRelationship": -5
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Include full project details including best-estimates for unknown entries based on previous experiences and an analysis of other projects.",
          "outcome": {
            "description": "Your statistical approach produced a reasonable approximation that meant more fields were filled in, but an audit later revealed some significant misrepresentations. The underlying data quality issues remain unresolved.",
            "impact": {
              "profit": 0,
              "dataQuality": -5,
              "cdoBudget": -50000,
              "clientRelationship": 5
            },
            "next": []
          }
        }
      },
      "minClientRelationship": 0,
      "maxDataQuality": 80
    },
    {
      "name": "critical_data_quality_alert_in_enterprise_systems",
      "end": false,
      "default": false,
      "sender": "Data Warehouse Team",
      "title": "Critical Data Quality Alert in Enterprise Systems",
      "content": "Our data quality monitoring has detected a significant increase in data errors across our enterprise systems. Error rates have jumped from 2% to 17% in the last month, with particular issues in customer support tables.",
      "category": "dataQuality",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Roll back to last month's stable data model and reprocess calculations",
          "outcome": {
            "description": "The rollback successfully restored data integrity but required significant manual work to reprocess a month of calculations. Some recent application changes had to be reimplemented, creating temporary process disruption.",
            "impact": {
              "profit": 100000,
              "dataQuality": 15,
              "cdoBudget": 150000,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Fix issues in place with an emergency data quality task force",
          "outcome": {
            "description": "The dedicated team identified a fault in the data pipeline between Arup and your client. Their targeted approach fixed critical issues quickly while minimizing business disruption, though some minor data inconsistencies remain.",
            "impact": {
              "profit": 100000,
              "dataQuality": 10,
              "cdoBudget": -100000,
              "clientRelationship": 5
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Put your data-engineers on implementing circuit-breaker logic to quarantine suspicious data automatically",
          "outcome": {
            "description": "The automated system successfully identified and isolated bad data, but legitimate calculations were occasionally quarantined as well. Client teams are frustrated with the additional verification steps now required.",
            "impact": {
              "profit": 100000,
              "dataQuality": 20,
              "cdoBudget": -50000,
              "clientRelationship": -5
            },
            "next": []
          }
        }
      },
      "minClientRelationship": 0,
      "maxDataQuality": 40
    },
    {
      "name": "gdpr_compliance_audit_findings",
      "end": false,
      "default": false,
      "sender": "Legal Department",
      "title": "GDPR Compliance Audit Findings",
      "content": "Our recent GDPR compliance audit has identified several areas requiring immediate attention. We need you to address these before our upcoming regulatory review.",
      "category": "gdpr",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Comprehensive remediation of all findings regardless of severity",
          "outcome": {
            "description": "The thorough approach satisfied regulators and established a gold standard for compliance. While costly to your project, it positioned the company as an industry leader in data protection.",
            "impact": {
              "profit": 50000,
              "dataQuality": 20,
              "cdoBudget": -300000,
              "clientRelationship": 15
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Complete a risk-based approach focusing only on high and medium severity issues.",
          "outcome": {
            "description": "The balanced approach addressed the most significant risks while managing costs. Regulators accepted the prioritization plan, though requested a timeline for addressing remaining items.",
            "impact": {
              "profit": 0,
              "dataQuality": 10,
              "cdoBudget": -100000,
              "clientRelationship": 5
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Only address the most critical findings and focus on your client delivery challenges",
          "outcome": {
            "description": "The minimal approach met basic requirements but drew regulatory scrutiny. Arup avoided immediate penalties but remains under increased oversight, and your client has expressed privacy concerns.",
            "impact": {
              "profit": 0,
              "dataQuality": -5,
              "cdoBudget": -50000,
              "clientRelationship": -15
            },
            "next": []
          }
        }
      },
      "minClientRelationship": 0,
      "maxDataQuality": 100
    },
    {
      "name": "sharing_site_data",
      "end": false,
      "default": false,
      "sender": "Client",
      "title": "Sharing site data?",
      "content": "The project is running well. We're gathering a lot of data on-site at the moment, how do you want us to share that with you?",
      "category": "Other",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Use the secure project portal to upload all data files, ensuring proper metadata tagging for easy access.",
          "outcome": {
            "description": "",
            "impact": {
              "profit": 0,
              "dataQuality": 0,
              "cdoBudget": 0,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Email the data files directly to the project manager for quick sharing.",
          "outcome": {
            "description": "",
            "impact": {
              "profit": 0,
              "dataQuality": 0,
              "cdoBudget": 0,
              "clientRelationship": 0
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Share the data via a public file-sharing link for convenience.",
          "outcome": {
            "description": "",
            "impact": {
              "profit": 0,
              "dataQuality": 0,
              "cdoBudget": 0,
              "clientRelationship": 0
            },
            "next": []
          }
        }
      },
      "minClientRelationship": null,
      "maxDataQuality": null
    },
    {
      "name": "data_labs_proposal",
      "end": false,
      "default": false,
      "sender": "Digital Technology Group",
      "title": "Data Labs Proposal",
      "content": "Our Digital Technology Group have partnered with Arup University to organise some global Data Labs to generate develop data literacy and generate new ideas for data-driven products. They're requesting director sponsorship and time for team members to participate.",
      "category": "misc",
      "isUrgent": false,
      "choices": {
        "1": {
          "name": "1",
          "text": "Encourage your teams to attend and become part of the steering committee to shape the design of the sessions.",
          "outcome": {
            "description": "The high-profile event achieved excellent engagement which resulted in numerous new product and service ideas. The global collaboration brought fresh thinking, though some concerns about intellectual property protection were raised.",
            "impact": {
              "profit": 400000,
              "dataQuality": 5,
              "cdoBudget": -3000000000,
              "clientRelationship": 15
            },
            "next": []
          }
        },
        "2": {
          "name": "2",
          "text": "Encourage a few of your team to participate and report back what they learnt.",
          "outcome": {
            "description": "The team members who attended identified some practical solutions which could be brought into your team. This delivered some immediate value and boosted your team's efficiency.",
            "impact": {
              "profit": 150000,
              "dataQuality": 10,
              "cdoBudget": -100000,
              "clientRelationship": 5
            },
            "next": []
          }
        },
        "3": {
          "name": "3",
          "text": "Decline the opportunity in favor of prioriotising project delivery and innovation",
          "outcome": {
            "description": "Focussing soley on client delivery resulted in deadlines being met and client satisfaction but dampened enthusiasm for your team's professional development. Several innovative employees expressed disappointment about the lack of creative opportunities and spontaneous collaboration.",
            "impact": {
              "profit": 100000,
              "dataQuality": -5,
              "cdoBudget": -300000,
              "clientRelationship": -5
            },
            "next": []
          }
        }
      },
      "minClientRelationship": 0,
      "maxDataQuality": 100
    }
  ],
  "priority": 1,
  "indicators": [
    {
      "name": "Profit",
      "nameId": "profit",
      "emoji": "📈",
      "initial": 0,
      "min": -10000000,
      "max": 10000000,
      "type": "dollars",
      "displayed": true,
      "color": "primary"
    },
    {
      "name": "Data Quality",
      "nameId": "dataQuality",
      "emoji": "📊",
      "initial": 50,
      "min": 0,
      "max": 100,
      "type": "percentage",
      "displayed": true,
      "color": "primary"
    },
    {
      "name": "CDO Budget",
      "nameId": "cdoBudget",
      "emoji": "💰",
      "initial": 1000000,
      "min": 0,
      "max": 10000000,
      "type": "dollars",
      "displayed": true,
      "color": "#9c27b0"
    },
    {
      "name": "Client Relationship",
      "nameId": "clientRelationship",
      "emoji": "🤝",
      "initial": 50,
      "min": 0,
      "max": 100,
      "type": "percentage",
      "displayed": true,
      "color": "#9c27b0"
    }
  ],
  "nameId": "who_can_lead",
  "library": [],
  "medals": [
    {
      "name": "gold",
      "threshold": 3500,
      "emoji": "🥇"
    },
    {
      "name": "silver",
      "threshold": 2000,
      "emoji": "🥈"
    },
    {
      "name": "bronze",
      "threshold": 500,
      "emoji": "🥉"
    }
  ],
  "card": {
    "plan": "free",
    "title": "Who can lead with data?",
    "shortDescription": "",
    "difficulty": "Beginner",
    "skillsAcquired": [],
    "context": {
      "program": "",
      "domains": "",
      "roleFocus": "",
      "objective": ""
    },
    "metadata": {
      "category": "",
      "estimatedDurationMinutes": 0,
      "track": ""
    }
  }
}